class Quality {
    String 노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 = "";
    public void show() {
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 = "소프트웨어_공학_쪽보다는_요즘에_콘텐츠로_밀어봐라\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "지금_정말_급변하고_있다_그래서_이것저것_잘_준비하자\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "요즘에 공무원 상황도 민원이 다양해서 정말 빡세다..\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "그러니까 정말 확실히 뭘 할지 의견도 나누시고\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "07들은 특히 열심히 하자 교수님도 소상공인이다\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "이제 수업 시작합니다..\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "이제 요구사항 정의를 보자\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "이용자가 어떤 문제를 풀거나 목표를 달성하는데 필요한 조건이나 능력이 요구사항\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "집짓기를 예시로 하면 요구분석은 설계짜가 함.\n";
        노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다 += "클라이언트에게 어떤거를 의뢰했는지 상담을 함..\n";

        System.out.println(노트북lm을요즘에잘써보자__이게_요즘에_많이_발전되었다);
    }
}
class ClainEnt {
    String 이전에_제작한_포트폴리오를_대상으로_추가하거나 = "필요업슨ㄴ거는 삭제하고 해서 나눠지는 대화 과정\n";
    public void 요구분석22() {
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "요구분석이라는게 필수 기능 등등 파악\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "요구분석 목적은 금액, 피드백 보안사항 등등에 대한 근거이다...\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "요구분석 명세서 작성을 위한거다..\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "개발자는 학사 관리시스템에 참여하는 b개발사의 분석가 또는 프로그래머 등등\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "설계자\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "데이터 베이스 설계자 등등\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "요구 분석이 어려운 이유\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "법적인 문제를 해결할 경우네는 해당 분야에 대한 전문적인 변호사를 선임\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "it 전문가들은 요구분석에 대해서 다른 사람들이 많이 필요하기도 함\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "문제 영역과 관련된 프로젝트를 많이 개발한 경험이 많은 분석가를 투입하는게\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "일반적\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "요구분석이 어려운 이유\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "사용자와 분석가의 의사소통 문제\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "사용자의 계쏙되는 요구사항 추가하기 모호하게 말하면 겁나 불편함\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "소프트웨어 개발에서는 견본이 없는 경우가 있다.\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "이럴 때는 본인이 아는 지식으로 설명해야 하는데...\n";
        이전에_제작한_포트폴리오를_대상으로_추가하거나 += "이럴 때 사용자의 이해도가 부족하게 되면 계약 파기 등등의 문제가..\n";
        System.out.println(이전에_제작한_포트폴리오를_대상으로_추가하거나);
    }
}

class Three {
    String newString = "";
    public void newforms() {
        newString += "필요한 사항을 반영x 불필요한거를 반영하게 되면 나중에 개판난다..\n";
        newString += "모호한 요구사항일 경우에는 서로 상반되는 요구사항 등등 때문에 우선 순위를 매기는게 중요함\n";
        newString += "요구사항에서는 마케팅 담당자들이 많이 투입됩니다.2323\n";
        newString += "요구사항 수집\n";
        newString += "자료수집\n";
        newString += "인터뷰\n";
        newString += "설문 조사\n";
        newString += "설문 조사는 규격화 된 데이터를 구하고 싶을 때 사용함\n";
        newString += "요구 분석 절차\n";
        newString += "자료 수집\n";
        newString += "요구 사항 도출\n";
        newString += "문서화\n";
        newString += "검증\n";
        System.out.println(newString);
    }
}
class Four {
    String fourString = "";
    public void 규격화() {
        fourString += "수집한 자료들을 문서화 시키는게 요구분석 명세서이다...\n";
        fourString += "서로 모순된 사항은 없는지 확인하는게 정말 중요\n";
        fourString += "기능 요구사항과 비기능 요구사항이있다..\n";
        fourString += "시스템은 사용자에게 필요한 기능을 제공하는 거\n";
        fourString += "완전성은 사용자가 원하는 모든 긴응르 포함하는거\n";
        fourString += "일관성은 요구사항 간에 모순이 있어서 안됨...\n";
        fourString += "비기능 요구사항은 수행 가능한 환경 품질 제약 사항 등등등\n";
        fourString += "제약 사항\n";
        fourString += "프로그램 개발 툴은 어떤걸 서야되는지\n";
        fourString += "운영체제는 어떤거에서 돌아가는건지????????????\n";
        fourString += "기능 신뢰성?? 이건 비기능\n";
        fourString += "신뢰도는 장애 없이 동작하는 시간의 비율\n";
        fourString += "1000번 소프트웨어 실행시 1번 에러인 경우에는 99점9퍼센트\n";
        fourString += "신뢰도 높은 소프트웨어의 조건은\n";
        fourString += "시스템 오류가 있더라도 고장 x 회피 가능한 능력이 높아야...././././/.\n";
        fourString += "고장이 발생하더라도 이전 수준으로 성능이 회복되어야 함\n";
        fourString += "가용성은 소프트웨어가 총 운용시간 동안 얼마나 정상적으로 고장 없이 가동되었는지....\n";
        fourString += "MTBF\n";
        fourString += "MTTR\n";
        fourString += "MTBF는 평균 정상 작동 시간 또는 고장 간 평균 시간\n";
        fourString += "MTTR은 평균 수리 시간\n";
        fourString += "수리 시간의 합을 회수로 나눈 값이 평균 수리 시간..././././.\n";
        System.out.println(fourString);
    }
}

class Five {
    String fivString = "";
    public void fiShow() {
        fivString += "나중에 프로그램 개발이나 비용 산정을 할 때 규격화 하기 위해서 위와 같은 방식들을 활용함\n";
        fivString += "표현과 모델의 이해\n";
        fivString += "요구사항에서 표현은 어떻게 하는가??\n";
        fivString += "표현은 말 그대로 뭘 나타내는 거\n";
        fivString += "수학 공식은 글로 표현하면 너무 길고 불분명...\n";
        fivString += "모델은 표현을 위해 사용하는 악보나 숳학 공식 느낌\n";
        fivString += "모델은 규격화를 시킬 때 활용해야 하는거\n";
        fivString += "소프트웨어 개발 모델은 \n";
        fivString += "UML 등등이 있다...\n";
        fivString += "소프트웨어 개발 모델 사용의 장점\n";
        fivString += "이해도 향상\n";
        fivString += "유지보수 용이\n";
        fivString += "단점은\n";
        fivString += "과도한 문서 작업으로 일정 지연\n";
        fivString += "모델링은\n";
        fivString += "모델링은 설계하는 전체적인 과정이다...\n";
        fivString += "db 설계도 모델링이다..\n";
        fivString += "\n";
        System.out.println(fivString);
    }
}

class Six {
    String sixStr = "6\n";
    public String sixShow() {
        sixStr += "모델링 언어는 악보 기호, 수학 기호, 등과 uml 다어어그램 z 언어와 같은 형식적 표기법 등등이 있다.\n";
        sixStr += "모호한 표현이 없고 일관되어 모델링 하는데 매우 유용하다.. 사용자의 요구사항을 검증하는 의사소통 도구로도 사용\n";
        sixStr += "\n";
        sixStr += "\n";
        sixStr += "\n";
        sixStr += "\n";
        sixStr += "\n";
        return sixStr;
    }
}

class Seven {

}

public class GroomiTime {
    public static void main(String[] args) {
        Quality newnew = new Quality();
        newnew.show();
        ClainEnt 요구분석 = new ClainEnt();
        요구분석.요구분석22();
        Three groomi = new Three();
        groomi.newforms();
        Four groomigroom = new Four();
        groomigroom.규격화();
        Five 이거 = new Five();
        이거.fiShow();
        System.out.println();
        Six six = new Six();
        System.out.println(six.sixShow());

        System.out.println("위 출력값에서 \'요\'자가 몇 자인지 개수를 세어주세요.");
    }
}
