class 패키지 {
	String 패키지는서로관련된클래스들을 = "하나의 공간으로 묶은단위";
	String 클래스파링을논리적으론정리하고 = "관리하는 폴더 시스템";
	String 클래스이름충돌방지를위해서_패키지를사용한다 = "패키지를 통해서 접근 제어 가능";
	String 상위패키지와_하위패키지가있으면_점으로_구분함 = "내가 참조해야 할 클래스가 있다면 이렇게";
	String 패키지선언예시 = "package sec01.exam01";
	String 기본적으로패키지를안만들게되면프로젝트이름을줬던거로 = "클래스를 만들게 된다....";
	String 패키지를지정하고그아래에다가_하위패키지를_지정할_수가있다 = "워크스페이스라는 곳에서 설치되어지는 폴더";
	String 패키지_작성시_주의할점은_소문자로하는_것을추천함 = "패키지하고 뭐뭐 써줄 때는 맨 위에";
	String 다른_클래스_패키지 = "ctrl shift o 누르면 임포트할 거를 찾음";
	String 여러개를_한꺼번에_가져오고_싶을때는 = ".*로 나타내면 된다.. ";
	String 자바유틸리티안에있는_모든거를가져오는거는_별이다 = "뉴 패키지 선택해서 패키지를 새롭게 만들 수가 있는데,,";
	String 이클립스에서는_new_package_해서_만들수가있다 = "그 다음에 이제 접근 제한자";
	String 패키지화_시키는이유가뭐냐면 = "접근을 시켜야 하는 거랑 아닌거 등등으로 구분하는 거";
	String 허용범위넓은_순public = "protected default (생략) private";
}

class package22 {
	String private을쓰게되면_그_클래스안에서만 = "위와 같은 범위를 파악해보자";
	String 같은클래스내부에서는_제한자_상관없이_다_접근가능 = "package t가 있고 package s가 있다. 다른 package에서는 public 은 다른 패키지에서 사용 가능";
	String protected는_다른패키지에서_는_다른_패키지_안의_상속된 = "public은 가장 개방적인 권한을 제공한 ㅈ접근 제한자";
	String 실제로실행파일을가지고있는게public이다_여러게의_퍼블릭_클래스를만드려면_별도파일구성 = "예시로는";
	String public_class_donut = "이런식으로된다";
	String 여기보면_도넛 = "클래스가";
	String 다른클래스에서도접근가능하고 = "지금까지 하나의 단일 파일으로 했다면 오늘부터는 여러가지 파일로 해서 임포트도 하고 여러가지 해볼거다..";
	String 다른클래스에서도접근가능하고2 = "지금까지 하나의 단일 파일으로 했다면 오늘부터는 여러가지 파일로 해서 임포트도 하고 여러가지 해볼거다..";
	String 다른클래스에서도접근가능하고3 = "지금까지 하나의 단일 파일으로 했다면 오늘부터는 여러가지 파일로 해서 임포트도 하고 여러가지 해볼거다..";
	String 다른클래스에서도접근가능하고4 = "지금까지 하나의 단일 파일으로 했다면 오늘부터는 여러가지 파일로 해서 임포트도 하고 여러가지 해볼거다..";
}

public class October29 {

	public static void main(String[] args) {
		패키지 pack = new 패키지();
		String str1 = pack.패키지는서로관련된클래스들을;
		
	}

}
