#오늘도 생성되는 과제입니다.
출석 = "체크"
늦게오신분들출석체크 = "필수"
출석체크 = 출석
지도학습 = "비지도학습도 공부하세요"
머신러닝수행방법 = "로지스틱스 이런 등등의 내용도 정말 중요함222"
숫자사번은 = 머신러닝수행방법 + "수업 내용 쓰시거나 하면"
숫자사번은 = "나는 생각하기에 배운데로 썼는데 이상하면 손들어 주세요"
타당하면은 = "기준은 머신러닝은 기계한테 가르치는 거다. 지도학습 비지도학습. 등등으로 "
타당하면은 += "교안은 언어 모델을 기준으로 써진 책이라서"
지도비지도강화학습이 = "머신러닝 종류들입니ㅏㄷ."
지도비지도강화학습이 += "수행방법 linear regression 등등으로 다양하게 책에 다 있습니다.112222"
지도비지도강화학습이 += "주관이 생길수도 있고 그러니까 내용하고 해당되는 내용하고 타당성 보내주시길 바랍니다..."
숫자사번은 = "이제 수업 시작"
숫자사번은 = "머신러닝은 wx + b를 수행하는거? w와 b 값을 점점 수정해 나가는게 머신러닝"
숫자사번은 += "중간중간에 시그모이드 함수가 나왔다. s자 형태"
숫자사번은 = "딥러닝은 퍼셉트론이 핵심, -> 이거하고 그래프의 개념이 머신러닝에서도 나와요"
타당하면은 += "오늘 교안에서는 gate 문제가 나온다."
편미분에서는 = "체인룰도 나오고 수학시간 같은 느낌이다."
지도학습 += "일단 교안을 보고 이야기를 할게요."
출석 += "다른 책을 참조할 수도 있다. 퍼셉트론은 w 이런거의 하나의 단위다."
머신러닝수행방법 += "linear 리그레이션 등등"
타당하면은 = "결과적으로는 w를 수정하기 위해서 cost 함수를 구하는 방법을 배웠다."
타당하면은 = "cost 함수는 tensorflow가 구해준다."
지도비지도강화학습 = "앞에 들어간 값이 출력에 어떤 영향을 미치는 것을 확실히 중요하게 여겨서 w값을 갱신해야 함"
지도지도강화학습 = "개념은 이렇게 된다."
지도지도강화학습 += "이렇게 하나를 내는게 퍼셉트론이다."
어떤퍼셉트론을가지고 = "뭐를 해볼 수 있을까????? 지평선 파밍????? 뭔 할 수가 없었다."
컴퓨터는_논리회로 = "논리회로로는 처리를 못하는 문제가 있었다."
이책에고등학생을위한딥러닝이있다 = "지금 우리책에서는 gate에 대해서는 정확하게 설명을 하고 있지는 않는다.....,.,.,.,.,.,.,.,.,."
이책에고등학생을위한딥러닝이있다 += "https://wikidocs.net/book/9049"
위주소가책링크주소이다 = "https://wikidocs.net/238107"
위주소가책링크주소이다 += "위 링크가 xor문제 링크입니다."
컴퓨터는_논리회로 += "rand는 메모리를 많이써서 렌드플렛이라고??"
이게뭐냐면은 = "a에서 x로 간다. and는 두개의 입력을 받아서 같으면 True"
이게뭐냐면은 += "다르면은 False로 나옴."
논리게이트는 = "논리게이트를 통해서 컴퓨터를 사용할 수 있는거다....,.,/.,.,/.,/,/.,."
논리게이트는 += "and or not을 조화롭게 조화해서 xor 등의 다양한 거를 만들 수 있습니다."
타당하면 = "a n d  o r n o t은 구별이 된다."
타당하면 += "결과를 가지고 이야기를 할 수 있냐 없냐를 이야기 하는 거다.."
실습을이따가 = "and 게이트에서 퍼셉트론으로 나눌 수 있냐 없냐??? 0 0이었을 때, and 게이트에서는 0이 나온다.."
출석체크 += "리니어 리그레이션으로 이진회로를 구별할 수 있다는 wx+b가 나온다..."
여기나왔잖아요 = "NAND는 and의 반대이다..."
xnor은__xor이아닐때 = "두개가 00이거나 11이면 참이 됩니다."
낫은 = "0일 때 1, 1 일 때 0"
x고y이다 = "이 좌표의 그래프입니다... "
영이겠죠 = "0이다 1이다"
영영이었을때 = "0이찍힌다.는게 and이다."
게이트 = ""
#and게이트
a = 0
b = 0
if (a == 0):
    if (b == 0): 
        게이트 = "0"
    elif (b == 1):
        게이트 = "0"
elif a == 1:
    if (b == 0): 
        게이트 = "0"
    elif (b == 1):
        게이트 = "1"
#not게이트
a = 0
if a == 0:
    게이트 = "a 1"
elif a == 1:
    게이트 = "a 0"
게이트 = "0과 1만 가지고는 아무것도 못함 그래서 조화를 만들어서 해야하는게 중요하다."
게이트 += "논리회로는 더하기 빼기 등등으로 뭔가를 하려고 만들어지게 된거다."
우리가지금쓰는트렌지스터는 = "다리가 3개있다. 3개의 게이트에 가운데에 전압을 주게 되면 도체??"

우리가지금쓰는트렌지스터는 += "논리 게이트는 1학년 때 원래 배운다... c는 c 맞으라고 c언어인거야....."
지도학습 = """컴퓨터 쪽은 전자 + 소프트웨어 쪽이다... 
반대로 찍히는 경우도 있다. 
and 게이트는 반원 모양의 뭔가가 있다. 그 앞에 동그라미가 있으면 반전기호이다.. 
or 게이트는 약간 기타피크 모양이다....
글자가 어디있나???????
and 게이트에요
새 슬라이드.....
복사해서 하면 되겠죠????
가장 기본 게이트는 and or not입니다.
여기서 섞어서 다른 애들을 만들어 내는거다.
이거 원래 칩 꽃으면서 실험을 하는 거라는데,
지금은 여기에 없어서....

"""
지도힉습 = """ 새 프로젝트 ctrl c
ctrl v
wx + b가 
80년대만 해도 컴퓨터에 os가 없었다.
진짜 계산기 느낌이다....
컴퓨터를 쓰면 엄청 빨랐었다...."""
지도학슾 = """ 예전에는 아날로그 신호였다.
디지털 신호가 잘 안나왔었다.
신호를 아날로그로 변환하는 장치도 있었고,,,.,.,.
디지털 신호
들어가면
아날로그로 나오는
것도 있고
그 반대로 되는
거도
있게 된다...
"""
지도악습 = """ 결과적으로
인공지능을
타야?되는데,,,,..
요게 어떤 형태를 보여준다.
이런게 진리표이다...
아 머리아파?
이럴 ㅅ ㅜ있다...
지금이야 정말 발전했지만
예전에는 트렌지스터도 많이 꽃혀있고,
등등으로 복잡했다...

wx + b로는 xor을 할 수 없다.????
이거 가지고는 안되네, 회로가지고는 안되네....
이런상황에서 퍼셉트론의 인기가 줄어들었다....,.,.,.,.,.
50년대 쯤에 퍼셉트론이 나왔다?>
퍼셉트론이 단층 퍼셉트론이라고.,,.,.
책에서 나왔잖아요???
대단히
큰
발전을한거다..
이걸
이제
좀
멋지게
표현해 볼게요
"""
지도학습 = """ 
그러면은
이제
조금
복잡하게
표현해
볼게요
여기서 이렇게
연결을 했는데,
wx플러스b에서 w가 나오는
것을
입력값이 x가
?
?
?
?
?
들어가는데
뭔가가
들어갈 때
또
이걸 가지고
뭘 태워야죠!2
결과적으로
뭘
냅니다.
항상
표혈
할
때
"""
지도힉습 = """ 
이제
요결
갖고
함수를
하나
더
태워요
이건
뒤에
나오는
거니까
그리기
어렵네,,,
0하고
1하고
고르는
문제죠
s자는
시그모이드
함수죠
w
x
+
b
해서
뭔가
출력이
나오죠???
x가
퍼셉트론
안에
들어가는
w를 갱신해
주는데
w를
갱신해서
임의의
출력값을
하나
내줍니다.
그 값을
z라고 합니다.

"""
지도학숩 = """
0과
1로
나올 수
있게
되는
데요.
그거를
wx
+
b
로
확인
할
수
있었다고
해요..
y
위에
짝대기
있는거는
y헷이라고
표현을
하는데.,.,,
그런데
책에는
hx라고
나오지만
결과적으로
y헷이라고도
표현을
함.
"""
지도학습 = """
교안이
어딨냐?
우리
가
지금
하고
있는데가
퍼셉트론이죠
요말이
이거
그림이에요
여기까지
그린 내용이
도식화를 한거다.
xor은
직선하나로 못그어요.
두개 이상의 직선을 써야되는데요.
이럴 때는 다층 퍼셉트론을 사용하는게 답
인 것 같다는 생각이 드는데요. 은닉층이 있어서 별
차이가 없어서., 액티베이션 함수가 더 들어가서 찌그러트리니까
히든 레이어 여기에서 나옵니다. 퍼셉트론 연산만해도 nand를 구현할 수
있지 않을까????????????????????하고 생각을 하게 되었습니다. nand가 아닌 xor 문제를
해결을 못해요. and or not 등등을 조합해서 나타내야 한다고 합니다..
하나 둘 이렇게 있어요.... 아이고 네모를 그리고요. 이렇게 여러
층을 두는거에요. 그래서 뭐를 해볼 수 있지 않을까 하는 
동그라미 안에 들어있는게 뭔죠???? 뭘까요??? 뭐지?
한 분 빨리 대답해라.. 이게 가중치이다. 
맞습니다. w가 가중치이다.. bias는
이미 들어가 있잖아요.....

"""
직도학습 = """
multilayer
perceptron은
다층
퍼
셉
트
론
입니다.
옛날
사람들이
읽기
어려운
문제를
냈습니ㅏㄷ.
xor이라고도
불리는
익스클루시브 오알
이 있다.
다층
퍼셉트론에
냈는데
다층
퍼셉트론은
로지스틱
리그레이션이
여러개
있으면
되는거다.
"""
if 1 == 1:
    if 1 == 1:
        if 1 == 1:
            if 1 == 1:
                if 1 == 1:
                    if 1 == 1:
                        if 1 == 1:
                            if 1 == 1:
                                if 1 == 1:
                                    if 1 == 1:
                                        if 1 == 1:
                                            if 1 == 1:
                                                if 1 == 1:
                                                    if 1 == 1:
                                                        if 1 == 1:
                                                            if 1 == 1:
                                                                if 1 == 1:
                                                                    if 1 == 1:
                                                                        if 1 == 1:
                                                                            if 1 == 1:
                                                                                if 1 == 1:
                                                                                    if 1 == 1:
                                                                                        if 1 == 1:
                                                                                            if 1 == 1:
                                                                                                if 1 == 1:
                                                                                                    if 1 == 1:
                                                                                                        if 1 == 1:
                                                                                                            if 1 == 1:
                                                                                                                if 1 == 1:
                                                                                                                    if 1 == 1:
                                                                                                                        if 1 == 1:
                                                                                                                            if 1 == 1:
                                                                                                                                if 1 == 1:
                                                                                                                                    지도학습 = "지도학습"

지돌학습 = """
다층으로
입력을
해보자
이거죠
식은
wx => y
더 간략하게는
2개의
입력이
있죠?
"""
지도학습
