class 경사하강법:
    def 경사하강법수행(running_rate):
        return running_rate * 3
    def 가짜local_mininum_이_생기는데_노트에있는거는_꼬불꼬불한거(튀어나가버리면_에러뜸):
        가짜_최소값 = "이런점을만났을 때 0이 되는거다..."
        최소값이_발산하게_되면은_학습이_안된다 = "....." + 가짜_최소값
        return 튀어나가버리면_에러뜸 + "머신러닝에서 경사하강법은 중요하다..." + 최소값이_발산하게_되면은_학습이_안된다

#main ------------------------------------------------------------------------------------------------
deeping_learning_tensorflow = "PyTorch_is_show_on_the_world"
PyTorch = "Keras\n"
PythonIsInterpreTerMul = " more than c_lang, but very slow...\n"
GPUAndCPUPowerISSoUpupup = " now 2026 and pandas is data to for, \n 2chawon is pandas \n numpy는 행렬 연산\n"
단순선형회귀_weight를구하는거_wx_plus_b = "w는 가중치, b는 편향"
print(deeping_learning_tensorflow + PyTorch + PythonIsInterpreTerMul + GPUAndCPUPowerISSoUpupup + 
      단순선형회귀_weight를구하는거_wx_plus_b)
for i in range(12):
    if i % 2 == 0:
        print(i, "우진이 어머니는 참교육에서 나옵니다.\n\
matplotlib에서는 plt.plot()라고 나옵니다.!!!!!!!", sep="")
머신러닝에서의_단계 = "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n\
모델링 훈련 + 평가 + 배포"
수집다음에전처리다 = "제일긴게답이다..."
앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다 = 1
판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거 = 2.2
이차원_처리할때는_판다스가_가장_편하다 = "!"
if 머신러닝에서의_단계 == "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n모델링 훈련 + 평가 + 배포":
    print(머신러닝에서의_단계 + 수집다음에전처리다, 앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다, \
          판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거, \
          이차원_처리할때는_판다스가_가장_편하다)
지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 = 3
강아지냐_호랑이냐_값을_보여주는거 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 + 1
이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 \
+ 강아지냐_호랑이냐_값을_보여주는거
regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다 = 이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 \
+ 강아지냐_호랑이냐_값을_보여주는거 + 강아지냐_호랑이냐_값을_보여주는거
print(regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다)

알파곱하면은_옆으로가니까 = 경사하강법
running_rate가컸을때는_경사하강을_할때는 = 알파곱하면은_옆으로가니까.경사하강법수행(3)
print(running_rate가컸을때는_경사하강을_할때는)
