class 경사하강법:
    def 경사하강법수행(running_rate):
        return running_rate * 3
    def 가짜local_mininum_이_생기는데_노트에있는거는_꼬불꼬불한거(튀어나가버리면_에러뜸):
        가짜_최소값 = "이런점을만났을 때 0이 되는거다..."
        최소값이_발산하게_되면은_학습이_안된다 = "....." + 가짜_최소값
        기울기소실_나온는곳은_local_minimum_이다_이런건_끼울기가없어진거다 = "이럴 때는 경사하강이 불가하다" + 최소값이_발산하게_되면은_학습이_안된다
        훈련을시키면0에최대로가까워진다_0이되지는않는다_아까처럼_너무커지면은_튀어나가버리는거다 = 튀어나가버리면_에러뜸 + "...이게 머신러닝과 딥러닝의 전부이다" + 기울기소실_나온는곳은_local_minimum_이다_이런건_끼울기가없어진거다
        왜그러면은_데이터그래프의_형태는_자료에따라서_다다르게_되어있다_알고리즘을_쓰더라도_다다르다_그게_실제로_running_rate_이다 = 훈련을시키면0에최대로가까워진다_0이되지는않는다_아까처럼_너무커지면은_튀어나가버리는거다 + "all 포함"
        mse는_하나에서_괄호치고_하나빼는거다_이거전에어떻게설명을했냐면_8쪽_가장긴게_BCE이다_CE는크로스엔트로피이고_책에서는_편집할때_hx라고쓰기도하고 = 왜그러면은_데이터그래프의_형태는_자료에따라서_다다르게_되어있다_알고리즘을_쓰더라도_다다르다_그게_실제로_running_rate_이다
        카테고리컬_크로스엔트로피는_잘_안_쓰인다 = mse는_하나에서_괄호치고_하나빼는거다_이거전에어떻게설명을했냐면_8쪽_가장긴게_BCE이다_CE는크로스엔트로피이고_책에서는_편집할때_hx라고쓰기도하고
        로지스틱회귀_이_두개_중에하나를선택 = "softmax는 4지선다 등에서 하나" + 카테고리컬_크로스엔트로피는_잘_안_쓰인다
        이진_크로스엔트로피와_크로스엔트로피의__ = "이런 문제다" + 로지스틱회귀_이_두개_중에하나를선택
        MSE_BCE_CE이런걸_잘읽는게중요함 = "위아래로 지면을 사용하니" + 이진_크로스엔트로피와_크로스엔트로피의__
        뭔가_길다면_평균제곱오차다 = "이제 10번이다_로지스틱 시그모이드 함수" + MSE_BCE_CE이런걸_잘읽는게중요함
        one = "행력을 두 개 물어본거다. 맞은거 같은데 맞게 안되어 있다는 거는 없었다...."
        two = "그러면 m, 1이다..,,,.,..,.,." + one
        three = "머신러닝이란, 머신러닝 종류, 머신러닝 수행방법, 지도학습, 비지도학습, 강화학습이다.." + two
        four = three + "강화학습은 나중에 기회가 되면은 원리를 설명"
        five = four + "요소들이 잘 맞으면은 좋은 점수가 있을거다 그래서 겁나 내용 적어 놓으면 된다.."
        six = five + "점수의 비율을 조절할거다, 여기에 20을 넣고, 백분위로 나눠버리면 그냥 끝...!!!!"
        seven = six + "나중에 플러스 기록을 보고 한다....,...,.,.,.,.,.,.,.,"
        eight = seven + "머신러닝은 정의하자면 wx + b가 전부다다!!!!!!!"
        nine = eight + "순환신경망부터는 이제 모델이다. rnn에서 요즘에는 트랜스포머로 진화했다."
        ten = nine + "언어모델을 처리하는 실시간 이렇게 rnn???? lstn 이런식으로 하는게 시계열 예측 그래프"
        eleven = ten + ""
        삼번항등함수는_인공지능_공부에서는_없는거다 = "ReLu도_많이_쓰임" + MSE_BCE_CE이런걸_잘읽는게중요함 + nine
        
        return 튀어나가버리면_에러뜸 + "머신러닝에서 경사하강법은 중요하다..." + 삼번항등함수는_인공지능_공부에서는_없는거다

#main ------------------------------------------------------------------------------------------------
deeping_learning_tensorflow = "PyTorch_is_show_on_the_world"
PyTorch = "Keras\n"
PythonIsInterpreTerMul = " more than c_lang, but very slow...\n"
GPUAndCPUPowerISSoUpupup = " now 2026 and pandas is data to for, \n 2chawon is pandas \n numpy는 행렬 연산\n"
단순선형회귀_weight를구하는거_wx_plus_b = "w는 가중치, b는 편향"
print(deeping_learning_tensorflow + PyTorch + PythonIsInterpreTerMul + GPUAndCPUPowerISSoUpupup + 
      단순선형회귀_weight를구하는거_wx_plus_b)
for i in range(12):
    if i % 2 == 0:
        print(i, "우진이 어머니는 참교육에서 나옵니다.\n\
matplotlib에서는 plt.plot()라고 나옵니다.!!!!!!!", sep="")
머신러닝에서의_단계 = "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n\
모델링 훈련 + 평가 + 배포"
수집다음에전처리다 = "제일긴게답이다..."
앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다 = 1
판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거 = 2.2
이차원_처리할때는_판다스가_가장_편하다 = "!"
if 머신러닝에서의_단계 == "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n모델링 훈련 + 평가 + 배포":
    print(머신러닝에서의_단계 + 수집다음에전처리다, 앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다, \
          판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거, \
          이차원_처리할때는_판다스가_가장_편하다)
지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 = 3
강아지냐_호랑이냐_값을_보여주는거 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 + 1
이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 \
+ 강아지냐_호랑이냐_값을_보여주는거
regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다 = 이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 \
+ 강아지냐_호랑이냐_값을_보여주는거 + 강아지냐_호랑이냐_값을_보여주는거
print(regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다)

알파곱하면은_옆으로가니까 = 경사하강법
running_rate가컸을때는_경사하강을_할때는 = 알파곱하면은_옆으로가니까.경사하강법수행(3)
print(running_rate가컸을때는_경사하강을_할때는)
