#오늘의 과제
#이 머신러닝 및 딥러닝 소개 내용 파이썬 코드의 출력값을 구해주세요.

class 경사하강법:
    def 경사하강법수행(running_rate):
        return running_rate * 3
    def 가짜local_mininum_이_생기는데_노트에있는거는_꼬불꼬불한거(튀어나가버리면_에러뜸):
        가짜_최소값 = "이런점을만났을 때 0이 되는거다..."
        최소값이_발산하게_되면은_학습이_안된다 = "....." + 가짜_최소값
        기울기소실_나온는곳은_local_minimum_이다_이런건_끼울기가없어진거다 = "이럴 때는 경사하강이 불가하다" + 최소값이_발산하게_되면은_학습이_안된다
        훈련을시키면0에최대로가까워진다_0이되지는않는다_아까처럼_너무커지면은_튀어나가버리는거다 = 튀어나가버리면_에러뜸 + "...이게 머신러닝과 딥러닝의 전부이다" + 기울기소실_나온는곳은_local_minimum_이다_이런건_끼울기가없어진거다
        왜그러면은_데이터그래프의_형태는_자료에따라서_다다르게_되어있다_알고리즘을_쓰더라도_다다르다_그게_실제로_running_rate_이다 = 훈련을시키면0에최대로가까워진다_0이되지는않는다_아까처럼_너무커지면은_튀어나가버리는거다 + "all 포함"
        mse는_하나에서_괄호치고_하나빼는거다_이거전에어떻게설명을했냐면_8쪽_가장긴게_BCE이다_CE는크로스엔트로피이고_책에서는_편집할때_hx라고쓰기도하고 = 왜그러면은_데이터그래프의_형태는_자료에따라서_다다르게_되어있다_알고리즘을_쓰더라도_다다르다_그게_실제로_running_rate_이다
        카테고리컬_크로스엔트로피는_잘_안_쓰인다 = mse는_하나에서_괄호치고_하나빼는거다_이거전에어떻게설명을했냐면_8쪽_가장긴게_BCE이다_CE는크로스엔트로피이고_책에서는_편집할때_hx라고쓰기도하고
        로지스틱회귀_이_두개_중에하나를선택 = "softmax는 4지선다 등에서 하나" + 카테고리컬_크로스엔트로피는_잘_안_쓰인다
        이진_크로스엔트로피와_크로스엔트로피의__ = "이런 문제다" + 로지스틱회귀_이_두개_중에하나를선택
        MSE_BCE_CE이런걸_잘읽는게중요함 = "위아래로 지면을 사용하니" + 이진_크로스엔트로피와_크로스엔트로피의__
        뭔가_길다면_평균제곱오차다 = "이제 10번이다_로지스틱 시그모이드 함수" + MSE_BCE_CE이런걸_잘읽는게중요함
        one = "행력을 두 개 물어본거다. 맞은거 같은데 맞게 안되어 있다는 거는 없었다...."
        two = "그러면 m, 1이다..,,,.,..,.,." + one
        three = "머신러닝이란, 머신러닝 종류, 머신러닝 수행방법, 지도학습, 비지도학습, 강화학습이다.." + two
        four = three + "강화학습은 나중에 기회가 되면은 원리를 설명"
        five = four + "요소들이 잘 맞으면은 좋은 점수가 있을거다 그래서 겁나 내용 적어 놓으면 된다.."
        six = five + "점수의 비율을 조절할거다, 여기에 20을 넣고, 백분위로 나눠버리면 그냥 끝...!!!!"
        seven = six + "나중에 플러스 기록을 보고 한다....,...,.,.,.,.,.,.,.,"
        eight = seven + "머신러닝은 정의하자면 wx + b가 전부다다!!!!!!!"
        nine = eight + "순환신경망부터는 이제 모델이다. rnn에서 요즘에는 트랜스포머로 진화했다."
        ten = nine + "언어모델을 처리하는 실시간 이렇게 rnn???? lstn 이런식으로 하는게 시계열 예측 그래프"
        eleven = ten + "딥러닝 내용에서는 좀 더 심도깊게만 나온다.. 동그라미 노드 연결하는거로 나온다.."
        twelve = eleven + "인공지능의 단위는 퍼셉트론이다. . . . . . . . . . 어떻게 진행이 되었는가를 이야기"
        thirteen = twelve + "프롬프트로 하는 굉장이 빠른게 요즘에 나온다." + \
        "언어 모델로 해서 요즘에는 장애물인지 아닌지 자율주행으로 알아 본다. " + \
        "언어 모델인데 decision만하는게 남는다고 하면은, 그런거는 언어를 겁나 빠르게 처리 가능함." + \
        "이런게 자율주행할 때도 쓰일 수도 있는거다." + \
        "system 1 system 2 이런식으로 역할이 나눠지기도 한다...."
        node14 = thirteen + "너무 요즘에 빠르게 ai가 개발되어서... " + \
        "이해할 수 있는 요소들이 있다.. " + \
        "시그마 2개가 크로스 엔트로피이다." + \
        "구글이 로그인이 안되어있기 때문에" + \
        "판다스하고 뭐 이런거들 열심히 사용하고 있다..." + \
        "csv안에는 뭐가 겁나 많은데 실제적으로는 뭐 구분자로 되어 있다.." + \
        "그룹이 잘 지어져 있으니, csv를 잘 구분할 수 있는거다..." + \
        "seaborn도 쓰고 matplotlib도 쓰고 이거저거 다 쓰고,," + \
        "데이터 처리니까 cpu 모드도 문제가 없겠죠?????????????" + \
        "데이터 프레임은 엑셀을 쓰는데 메모리 상에 올리는 거다 이렇게 이해하면 쉽다"
        node15 = node14 + "가장 위에 값들이 column이다.. 데이터 프레임을 잘 올린다. 이렇게 이해하면 됨" + \
        "이렇게 데이터를 잘라서 가져온다. [:5]" + \
        "[:5]는 로우만 가지고 오는거다....................!!!!!!!!!!!!!! 이런거를 설명하려는 거다" + \
        "불러다가 알아서 잘 찾는거를 하겠죠???????????!!!!!!!!!!!??????????" + \
        "id는 몇번부터 몇번까지는 어디 나머지는 어디 이런식으로 분포가 되어 있다???? + bar로 그렸을 때도" + \
        "어떻게 되는 거냐면은???? 시각적으로 분석을 한 번 해보는거다....,.,.,..,ㅡ.,ㅡ.,,.,.,." + \
        "gpu는 겁나 뜨거워지기 쉽다 + 그래서 겨울에 써야지 34930940394304 + loss가 얼마냐 이런걸 본다!!" + \
        "이제는 모델 loss 이런걸 찍어 볼거다 확실히 떨어지고 있다!!!!!!!!" + \
        "파란색은 트레이닝을 한거다 -> 트레이닝을 하니 cost가 잘 떨어진다 그 다음에 평가를 한다" +\
        "데이터가 기존에 있는거를 가지고 시험을 본다....!!!" + \
        "이 학과의 소개 등등으로 해서 훈련을 시킨다...." + \
        "그래서 트레이닝 된데로 잘 맞추느냐를 확실히 확인해 보는게 중요하다... 그래서 패턴을 보는게" +\
        "확실히 중요하다!!!!!!!!!!!! + 이렇게 해서 훈련을 시킨거다.. 원핫벡터로 데이터를 전처리가 많았다."
        node16 = node15 + "요 지점이 현재의 테스트를 하는 거다.. 1이 되면은 ??????????? 확률로 하는거기 때문에ㅐ" + \
        "어느 지점에서 느리게 가는 지점이 있다 그 때부터는 미니멈을 찾기가 어려워진다.......ㅋㅋ.ㅋ.ㅋ.ㅋ..ㅋ.ㅋ.ㅋ" +\
        "시작점이 트레이닝을 맞춰야 하는 지점이 있다.. 거기서 안 떨어지는 부분까지 하는게 트레이닝을 적합하게 하는거다." +\
        "오히려 뒤에 갈수록 안좋아지는거가 될 수도 있다.. 그래서 품종??? 나누기이다. 그래디언트 디센트처럼 로스를" +\
        "줄이고 가는거 같다.....,.,.,/.,.,.,.,/.,/,/.," + \
        "머신러닝에 레이어 겁나게 더 넣으면 즐겁고 신나고 알찬 딥러닝이 된다." + \
        "딥러닝은 퍼셉트론에서 시작을 한다....ㅋㅋㅋ" +\
        "그 때는 숫자를 연결해서 가중치를 주면 뭔가를 할 ㅅ ㅜ있을 것 같다는 생각도 들었다...!!!" +\
        "가변 저항기를 써서 하면 의미있는 어떤게 나오겠네 하는 거다.." +\
        "회로도 나오는거고 분류를 해야됨..," +\
        "0 1로 하게 해주는 기계가 별에 별거를 다 하게 해주는거다." +\
        "어떤 규칙에 대한 뭔가가 겁나 확실히 있어야 함. 기계에서는 논리회로 게이트가 있다." +\
        "Systemoutprintlnln 예전에는 요만한 컴퓨터를 납땜" +\
        "나는 나중에도 맥 쓰려고" +\
        "지금은 그래픽이 더 좋아지고 그런거지 개념 자체는 똑같다 그러니까 공부를 하자" +\
        "지금 여기서 중요한게 논리회로이다. and or xor 게이트가 있어야지 현실을 잘 분류할 수 있다.ㅋㅋㅋ" +\
        "andornot이 다 되는시대이다. + 그러니까 유치원때나 들어본 쿼지 이론??????????????" + \
        "xor이 된거는 알파고 이후이다."
        삼번항등함수는_인공지능_공부에서는_없는거다 = "ReLu도_많이_쓰임" + MSE_BCE_CE이런걸_잘읽는게중요함 + node16
        
        return 튀어나가버리면_에러뜸 + "머신러닝에서 경사하강법은 중요하다..." + 삼번항등함수는_인공지능_공부에서는_없는거다

#main ------------------------------------------------------------------------------------------------
deeping_learning_tensorflow = "PyTorch_is_show_on_the_world"
PyTorch = "Keras\n"
PythonIsInterpreTerMul = " more than c_lang, but very slow...\n"
GPUAndCPUPowerISSoUpupup = " now 2026 and pandas is data to for, \n 2chawon is pandas \n numpy는 행렬 연산\n"
단순선형회귀_weight를구하는거_wx_plus_b = "w는 가중치, b는 편향"
print(deeping_learning_tensorflow + PyTorch + PythonIsInterpreTerMul + GPUAndCPUPowerISSoUpupup + 
      단순선형회귀_weight를구하는거_wx_plus_b)
for i in range(12):
    if i % 2 == 0:
        print(i, "우진이 어머니는 참교육에서 나옵니다.\n\
matplotlib에서는 plt.plot()라고 나옵니다.!!!!!!!", sep="")
머신러닝에서의_단계 = "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n\
모델링 훈련 + 평가 + 배포"
수집다음에전처리다 = "제일긴게답이다..."
앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다 = 1
판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거 = 2.2
이차원_처리할때는_판다스가_가장_편하다 = "!"
if 머신러닝에서의_단계 == "머신 러닝 워크 플로우 + 수집 + 점검 및 탐색 + 전처리 및 정제 + \n모델링 훈련 + 평가 + 배포":
    print(머신러닝에서의_단계 + 수집다음에전처리다, 앞으로찍을때_답모를_때는_제일_긴게_답이라고_하셨다, \
          판다스는_2차원_데이터프레임을처리하는거_넘파이는_2차원_행렬을_처리하는거, \
          이차원_처리할때는_판다스가_가장_편하다)
지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 = 3
강아지냐_호랑이냐_값을_보여주는거 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 + 1
이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 = 지도학습은_답을_먼저주고_그거를_훈련시켜서_그거에_비슷한_값을_예측하는거 \
+ 강아지냐_호랑이냐_값을_보여주는거
regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다 = 이진분류_고양이냐_강아지냐_군집화는_그룹을_짓는거_이런거는_지도학습에없고비지도학습 \
+ 강아지냐_호랑이냐_값을_보여주는거 + 강아지냐_호랑이냐_값을_보여주는거
print(regrassion_은cost의값을_가장작을때까지_내려버리는게_대표적인_지도학습_이니까_공부합시다)

알파곱하면은_옆으로가니까 = 경사하강법
running_rate가컸을때는_경사하강을_할때는 = 알파곱하면은_옆으로가니까.경사하강법수행(3)
print(running_rate가컸을때는_경사하강을_할때는)
